import 'package:intl/intl.dart';

List<String> trackWidgetTitle = [
  "\'PLANTABIT\'이(가) 사용자의 위치에 접근하도록 허용하겠습니까?",
  "\'PLANTABIT\'이(가) 사용자의 사진에 접근하도록 허용하겠습니까?",
  "\'PLANTABIT\'이(가) 모든 데이터에 접근하도록 허용하겠습니까?"
];

List<String> trackWidgetSubText = [
  "사용자의 현재 위치가 추적되며 경로, 주변 검색 결과를 예상하는데 사용됩니다.",
  "\'PLANTABIT\'이 사진 또는 동영상을 촬영하여 전송, 음성/영상 통화 기능 사용을 위해 사진 라이브러리에 접근하도록 허용합니다.",
  "\'PLANTABIT\'이 사용자의 휴대폰에 저장된 모든 데이터에 액세스할 수 있습니다."
];

List<String> messageText = [
  "Text Message",
  DateFormat("EEE, MMM d").add_jm().format(DateTime.now()).toString(),
  "아, 굉장히 상징적인 앱이군요? 다른 사람과 대화를 나누며 관계를 쌓을 수 있죠.",
];

List<String> instagramText = [
  "자, 마음이 좀 편안해지나요? 익숙한 화면을 보니 조금은 안정적인 느낌을 받겠군요? 올라오는 게시글을 보며 아무 생각없이 \'좋아요\'를 누르고, 같이 있는 사람을 태그하죠.",
  "전부 똑같은 게시글에, 방송에서는 SNS 맛집이니, SNS에서 핫하다며 유행을 만듭니다. 우리는 뒤쳐졌다고 느끼고 소비하죠. PLANTABIT이 이런 앱이길 바랐나요?",
  "자, 다음 앱!"
];

List<String> endingText = [
  "잠시만요. 사실 \'PLANT 통합앱\'은 없습니다. 다음을 보시려면 이 말풍선을 눌러주세요.",
  "웃기지 않나요? 한 앱에서 결제하려면 다른 앱을 설치하고, 또 다른 계정을 만들어 개인 정보를 기업에 제공하죠.",
  "넘쳐나는 앱 시장 속에서 당신의 개인 정보는 안전한가요?",
  "개발자의 설교라니! 실망하셨나요? 앱 개발자로서, 더 나은 앱 생태계가 되었으면 좋겠습니다.",
  "이제 여러분은 다시 처음으로 돌아가서 제 앱을 사용하시면 됩니다. 아니라면, 삭제하셔도 좋습니다. 앱 생태계에 대해 생각해 보셨다면 충분합니다.",
  "아, 당신의 개인정보는 수집되지 않습니다. 애초에 서버가 없어서 와이파이 없이도 구동됩니다. 그러면, 홈 화면을 불러오겠습니다.",
  "플레이 해 주셔서 감사합니다.",
];
